---
kind: property
id: P:Autodesk.Revit.DB.TemporaryViewModes.CustomColor
source: html/45773356-1d6a-ad77-1fe3-26d575405f28.htm
---
# Autodesk.Revit.DB.TemporaryViewModes.CustomColor Property

Custom color for the TemporaryViewProperties mode.

## Syntax (C#)
```csharp
public Color CustomColor { get; set; }
```

## Remarks
If custom title is not empty, Temporary View Properties mode displays the colored view frame in custom color.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null